In [5]:
#Import libraries
import numpy as np
import pandas as pd

In [6]:
#Create a pandas series
my_series=pd.Series(range(1,51))

In [7]:
#View first 5
my_series.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
#View tail
my_series.tail()

45    46
46    47
47    48
48    49
49    50
dtype: int64

In [10]:
#Extract only values of without index
my_series.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50])

In [15]:
#Create a dictionary world cup to be used to build a dataframe
world_cup={'Team':['WI','WI','IND','AUS','PAK','SL','AUS','AUS','AUS','IND','AUS'],'Rank':[7,7,2,1,6,4,1,1,1,2,1],'Year':[1975,1979,1983,1987,1992,1996,1999,2003,2007,2011,2015]}

In [16]:
#Convert to dataframe
df_wc=pd.DataFrame(world_cup)
df_wc

   Team  Rank  Year
0    WI     7  1975
1    WI     7  1979
2   IND     2  1983
3   AUS     1  1987
4   PAK     6  1992
5    SL     4  1996
6   AUS     1  1999
7   AUS     1  2003
8   AUS     1  2007
9   IND     2  2011
10  AUS     1  2015

In [23]:
#Highest rank achieved by each of the teams
df_wc.groupby('Team')['Rank'].min()

Team
AUS    1
IND    2
PAK    6
SL     4
WI     7
Name: Rank, dtype: int64

In [24]:
#Which is the latest year in which each team won the WC
df_wc.groupby('Team')['Year'].max()

Team
AUS    2015
IND    2011
PAK    1992
SL     1996
WI     1979
Name: Year, dtype: int64

In [30]:
#Create a dictionary of world champions
World_champions={'Team':['IND','AUS','WI','PAK','SL'],'ICC Rank':[2,3,7,8,4],'Points':[874,787,753,673,855]}

In [31]:
#Create a dictionary of Chokers
chokers={'Team':['SA','NZ','ZM'],'ICC Rank':[1,5,9],'Points':[895,764,656]}

In [33]:
#Convert to Dataframe
df1=pd.DataFrame(World_champions)
df2=pd.DataFrame(chokers)

In [34]:
# Concatanate - ignore_index is to order the index
pd.concat([df1,df2],ignore_index=True)

  Team  ICC Rank  Points
0  IND         2     874
1  AUS         3     787
2   WI         7     753
3  PAK         8     673
4   SL         4     855
5   SA         1     895
6   NZ         5     764
7   ZM         9     656

In [35]:
#W/o ignore index
pd.concat([df1,df2])

  Team  ICC Rank  Points
0  IND         2     874
1  AUS         3     787
2   WI         7     753
3  PAK         8     673
4   SL         4     855
0   SA         1     895
1   NZ         5     764
2   ZM         9     656

In [36]:
##Merge

In [41]:
#Champion stats
champion_stats={'Team':['IND','AUS','WI','PAK','SL'],'ICC Rank':[2,3,7,8,4],'Points':[874,787,753,673,855]}
match_stats={'Team':['IND','AUS','WI','PAK','SL'],'WC_Played':[11,10,11,9,8],'ODIs_Played':[733,988,712,679,662]}

In [42]:
#Convert to Dataframes
df_champs=pd.DataFrame(champion_stats)
df_stats=pd.DataFrame(match_stats)

In [43]:
#Merge
pd.merge(df_champs,df_stats,on='Team')

  Team  ICC Rank  Points  WC_Played  ODIs_Played
0  IND         2     874         11          733
1  AUS         3     787         10          988
2   WI         7     753         11          712
3  PAK         8     673          9          679
4   SL         4     855          8          662

In [44]:
#Join

In [45]:
df_champs

  Team  ICC Rank  Points
0  IND         2     874
1  AUS         3     787
2   WI         7     753
3  PAK         8     673
4   SL         4     855

In [46]:
df_stats

  Team  WC_Played  ODIs_Played
0  IND         11          733
1  AUS         10          988
2   WI         11          712
3  PAK          9          679
4   SL          8          662

In [49]:
#Left Join
pd.merge(df_champs,df_stats,how='left',on='Team')

  Team  ICC Rank  Points  WC_Played  ODIs_Played
0  IND         2     874         11          733
1  AUS         3     787         10          988
2   WI         7     753         11          712
3  PAK         8     673          9          679
4   SL         4     855          8          662

In [48]:
#Right Join
pd.merge(df_champs,df_stats,how='right',on='Team')

  Team  ICC Rank  Points  WC_Played  ODIs_Played
0  IND         2     874         11          733
1  AUS         3     787         10          988
2   WI         7     753         11          712
3  PAK         8     673          9          679
4   SL         4     855          8          662

In [50]:
#Inner Join
pd.merge(df_champs,df_stats,how='inner',on='Team')

  Team  ICC Rank  Points  WC_Played  ODIs_Played
0  IND         2     874         11          733
1  AUS         3     787         10          988
2   WI         7     753         11          712
3  PAK         8     673          9          679
4   SL         4     855          8          662

In [51]:
#Outer Join
pd.merge(df_champs,df_stats,how='outer',on='Team')

  Team  ICC Rank  Points  WC_Played  ODIs_Played
0  IND         2     874         11          733
1  AUS         3     787         10          988
2   WI         7     753         11          712
3  PAK         8     673          9          679
4   SL         4     855          8          662

In [52]:
#Type Casting
txt='34'
type(txt)

str

In [56]:
num=int(txt)
print(type(num))
print(num)

<class 'int'>
34

In [62]:
txt='23.45'
print(type(txt))
flt=float(txt)
print(type(flt))
print(flt)
bl=bool(flt)
print(type(bl))
print(bl)
bool(0)
i=int(True)
j=int(False)
print(i)
print(j)

<class 'str'>
<class 'float'>
23.45
<class 'bool'>
True
1
0